# ConcreteSyntax.org -----------------------------------------------------------

# Copyright (C) 2011, 2012 Guillem Marpons <gmarpons@babel.ls.fi.upm.es>
#
# This file is part of Crisp.
#
# Crisp is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Crisp is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Crisp.  If not, see <http://www.gnu.org/licenses/>.

#+PROPERTY: tangle yes
#+PROPERTY: exports code

This is an Org-mode file with Haskell code blocks that can be tangled
(in a literate programming sense) within Emacs with C-c C-v t.

Code blocks in [[*Tests][Tests]] can be loaded and executed in a GHCi session
with C-C C-c.

* Tests

Load Haskell module, first time.

#+begin_src haskell :var pwd=(pwd) :tangle no :results output
  let cd_pwd = return $ ":cd " ++ drop 10 pwd :: IO String
  :cmd cd_pwd
  :cd ..
  :l Crisp.ConcreteSyntax
#+end_src

#+RESULTS:
: i, version 7.4.1: http://www.haskell.org/ghc/  :? for help
: Loading package ghc-prim ... linking ... done.
: Loading package integer-gmp ... linking ... done.
: Loading package base ... linking ... done.

#+begin_src haskell
  run :: Show t => Parser t -> String -> IO ()
  run p inp =
      do let r@(a, errors) = parse 
                             ((,) <$ pSpaces <*> p <*> pEnd) 
                             (createStr (LineColPos 0 0 0) inp)
         putStrLn ("--  Result: " ++ show a)
         if null errors then return ()
         else do putStr ("--  Correcting steps: \n")
                 show_errors errors
         putStrLn "-- "
      where show_errors :: (Show a) => [a] -> IO ()
            show_errors = sequence_ . (map (putStrLn . show))
  
  pa :: Parser String 
  pa = (:[]) <$> pSym 'a'
#+end_src

#+begin_src haskell :tangle no :results output
  let a = "FunctionDecl   or CXXMethodDecl"
  let b = "CXXMethodDecl and virtual and abstract"
  let c = "  virtual and CXXMethodDecl and abstract"
  let d = "CXXRecordDecl"
  let e = "(CXXRecordDecl)"
  let f = " (CXXMethodDecl and virtual) or CXXConstructorDecl   "
  let g = "CXXMethodDecl and FunctionDecl or  CXXConstructorDecl"
  let h = "CXXMethodDecl or  FunctionDecl and CXXConstructorDecl"
  putStrLn "OK"
  mapM_ (run pConceptSort) [a, b,    d, e, f]
  mapM_ (run pConceptAny)  [a, b, c, d, e, f]
  putStrLn "KO"
  mapM_ (run pConceptSort) [c, g, h]
  mapM_ (run pConceptSort) [   g, h]
  putStrLn "END"
#+end_src

#+RESULTS:
#+begin_example

*Crisp.ConcreteSyntax> *Crisp.ConcreteSyntax> *Crisp.ConcreteSyntax> *Crisp.ConcreteSyntax> *Crisp.ConcreteSyntax> *Crisp.ConcreteSyntax> *Crisp.ConcreteSyntax> OK
--  Result: MkConceptSMBox ((:⊔) (S "FunctionDecl") (S "CXXMethodDecl"))
-- 
--  Result: MkConceptSMBox ((:⊓) (S "CXXMethodDecl") ((:⊓) (A "virtual") (A "abstract")))
-- 
--  Result: MkConceptSMBox (S "CXXRecordDecl")
-- 
--  Result: MkConceptSMBox (S "CXXRecordDecl")
-- 
--  Result: MkConceptSMBox ((:⊔) ((:⊓) (S "CXXMethodDecl") (A "virtual")) (S "CXXConstructorDecl"))
--
--  Result: MkConceptBox ((:⊔) (S "FunctionDecl") (S "CXXMethodDecl"))
-- 
--  Result: MkConceptBox ((:⊓) (S "CXXMethodDecl") ((:⊓) (A "virtual") (A "abstract")))
-- 
--  Result: MkConceptBox ((:⊓) (A "virtual") ((:⊓) (S "CXXMethodDecl") (A "abstract")))
-- 
--  Result: MkConceptBox (S "CXXRecordDecl")
-- 
--  Result: MkConceptBox (S "CXXRecordDecl")
-- 
--  Result: MkConceptBox ((:⊔) ((:⊓) (S "CXXMethodDecl") (A "virtual")) (S "CXXConstructorDecl"))
--
KO
--  Result: MkConceptSMBox (S "Avirtual")
--  Correcting steps: 
--    Inserted  'A' at position LineColPos 0 2 2 expecting one of ['(', 'A'..'Z', '(', 'A'..'Z']
--    Inserted  "--" at position LineColPos 0 10 10 expecting one of ["{-", "--", "or"]
-- 
--  Result: MkConceptSMBox ((:⊓) (S "CXXMethodDecl") ((:⊓) (S "FunctionDecl") ((:⊓) (A "or") (S "CXXConstructorDecl"))))
--  Correcting steps: 
--    Inserted  "and" at position LineColPos 0 31 31 expecting one of ["{-", "--", "and"]
--    Inserted  "and" at position LineColPos 0 35 35 expecting one of ["{-", "--", "and"]
-- 
--  Result: MkConceptSMBox ((:⊔) (S "CXXMethodDecl") (S "FunctionDecl"))
--  Correcting steps: 
--    Inserted  "--" at position LineColPos 0 31 31 expecting one of ["{-", "--", "or"]
--
--  Result: MkConceptSMBox ((:⊓) (S "CXXMethodDecl") ((:⊓) (S "FunctionDecl") ((:⊓) (A "or") (S "CXXConstructorDecl"))))
--  Correcting steps: 
--    Inserted  "and" at position LineColPos 0 31 31 expecting one of ["{-", "--", "and"]
--    Inserted  "and" at position LineColPos 0 35 35 expecting one of ["{-", "--", "and"]
-- 
--  Result: MkConceptSMBox ((:⊔) (S "CXXMethodDecl") (S "FunctionDecl"))
--  Correcting steps: 
--    Inserted  "--" at position LineColPos 0 31 31 expecting one of ["{-", "--", "or"]
--
#+end_example

